/***********************************************************************
*! \file:                   global_var.h
*  \projekt:                FT800_ESP
*  \created on:             25.07.2020
*  \author:                 R. Gräber
*  \version:                0
*  \history:                -
*  \brief                   Definitionsfile for global variables
***********************************************************************/
 
#ifndef _global_var_H_
#define _global_var_H_
 
/***********************************************************************
 * Includes
 **********************************************************************/
 #include "stdint.h"
/***********************************************************************
 * Informations
 **********************************************************************/
//https://www.dyclassroom.com/c/c-pointers-and-two-dimensional-array
 
/***********************************************************************
 * Declarations
 **********************************************************************/

#define glb_device_name_length  64
 
/***********************************************************************
 * Global Variable
 **********************************************************************/
extern uint8_t glb_MAC_address[6];
extern char glb_IPv4_address[24];
extern char glb_device_name[glb_device_name_length];

struct spiffs_flags_tag{
   uint8_t spiff_mounted : 1;
   uint8_t spiff_config_file_found : 1;
};

struct wlan_properties_tags{
   uint8_t wlan_enabled : 1;
   uint8_t wlan_ap_modus : 1;
   const char*  ssid;
   const char*  passwd;
};
/***********************************************************************
 * Constant
 **********************************************************************/
 
/***********************************************************************
 * Macros
 **********************************************************************/
 
/***********************************************************************
 * Funtions definded in main.c
 **********************************************************************/


#endif //_global_var_h_